import config from 'root/config.json';
import React from 'react';
import Grid from 'react-bootstrap/lib/Grid';
import Row from 'react-bootstrap/lib/Row';
import Col from 'react-bootstrap/lib/Col';
import Well from 'react-bootstrap/lib/Well';
import Media from 'react-bootstrap/lib/Media';
import Button from 'react-bootstrap/lib/Button';
import NavbarComponent from 'component/main/navbar';
import BottomNavbarComponent from 'component/main/bottom_navbar';
import MainPageStyle from 'style/main.scss';
import { browserHistory } from 'react-router';
import * as request from 'superagent';
import { Icon } from 'react-fa';
import faker from 'faker';
import courseStyle from 'style/mainPageCourse.scss';
import Jumbotron from 'react-bootstrap/lib/Jumbotron';
import ListGroup from 'react-bootstrap/lib/ListGroup';
import VencePhoto from 'style/asset/givencen.png';
import NealPhoto from 'style/asset/neal.png';
import WilliamPhoto from 'style/asset/william.png';
import RayPhoto from 'style/asset/ray.png';

export default class Agreement extends React.Component {
  constructor() {
    super();
  }

  render() {
    return (
      <Grid>
        <Col xs={2} md={1}></Col>
        <Col xs={14} md={10}>
            <div>
                <div>
                    <h1 className="agreementH1 bigMarginTop">思博锐协议（草案）</h1>
                </div>
                <div>
                    <h2 className="agreementH2"></h2>
                    <p className="pgraph"></p>
                    <p className="pgraph"></p>

                    <p className="pgraph">欢迎您来到思博锐。</p>
                    <p className="pgraph">请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入思博锐。当您注册成功，无论是进入思博锐，还是在思博锐上发布任何信息（即「信息」），均意味着您（即「用户」）完全接受本协议项下的全部条款。
</p>
                    <h2 className="agreementH2">用户账号和用户注册；教育合作伙伴</h2>
                    <p className="pgraph">虽然任何访客都可以查看课堂网点，但如需使用这些网点和参加网络课程，您必须选择一个登录身份（即用户ID）和用户密码。密码是唯一的，且应与用户名完全不同（统称为“用户账号”）。您同意您将不以任何理由泄露或与他人共享您的户账号。如您未获得相应资格，则不能参加网络课程。
</p>
                    <p className="pgraph">在设置用户账号时，系统可能会提示或要求您输入补充信息，包括但不限于您的姓名和电子邮箱。提供补充信息是为了确认您的身份。您理解并同意，您提供的所有信息均是准确、最新和完整的，并您将维护和更新您的信息以保证其准确、未过时和完整。您认可如您提供的任何信息存在不准确、过时或不完整的情况，我们保留在适当程度内终止您访问课堂网点、参加网络课程的权利。
</p>
                    <p className="pgraph">用户注册成功后，思博锐将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任</p>
                    <p className="pgraph">用户须对在思博锐的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；否则思博锐有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任
除注册流程之外，在您使用课堂网点、参加网络课程的过程当中，我们会获取您的相关信息和您在网络课程中的使用情况。部分信息可能为个人身份信息。我们可使用、保管以及存储这些信息，以便在当前和未来为您提供相关服务，同时可与第三方共享此类信息。
</p>
                    <p className="pgraph">隐私政策进一步阐述了我们如何对待您参加网络课程和在线求职时您提供的以及我们获得的信息。隐私政策与使用条款合并在一起，以供用户参考。请仔细阅读该政策有关收集、使用和披露您的个人信息的说明。如您接受使用条款，即默认接受我们的隐私政策。
</p>
                    <p className="pgraph">任何用户均可访问课堂网点，但网络课程仅供已注册了用户账号的学员使用。注册成功后，用户须同意以下条款： - 仅可注册一次，不得设置多个用户账号；且 - 遵守使用条款。
</p>
                    <p className="pgraph">如用户为学员身份，除上述条款外，学员还需同意并遵守以下要求： - 学员的注册目的是为完成已报名参加的网络课程和在线求职； - 学员需同意，任何网络课程的讲师均不承担保证该课程受到所有权威机构或教育机构认可的义务；另外，学员必须遵守下面列出的“学员行为准则”； -。
思博锐可与教育合作伙伴联合向学员提供网络课程，或代表其教育合作伙伴提供课程。您可以通过提供给您的单独的用户账号获得使用该课程的权限，您认可并同意，除了思博锐的使用条款之外，任何与教育合作伙伴相关的网络课程也应遵守教育合作伙伴的条款、政策以及流程的规定。
</p>
                    <p className="pgraph">思博锐和网络课程讲师保留修改、变更和重新制订课题计划和各项作业、测试、测验、考试、项目及其它进度评估项的分值和权重的权力。学员如果参加了网络课程，即已经承认思博锐和讲师保留调整、变更和修改该课程的权力。
</p>
                    <h2 className="agreementH2">思博锐的知识产权</h2>
                    <p className="pgraph">课堂网点、网络课程由思博锐及其许可人所有和负责运营。思博锐保留随时不定期暂时性或永久性修改、中止课堂网点、网络课程及其任何部分的权力，并自行决定是否通知用户。用户需同意，思博锐针对课堂网点、网络课程及其任何部分进行的修改、暂停或中止，无需对任何用户或第三方机构承担责任。在本使用条款中，无任何规定要求思博锐必须在其执行期间维护和支持课堂网点、网络课程及其任何部分。
</p>
                    <p className="pgraph">课堂网点和网络课程所提供的所有内容或资料，包括但不限于在线讲座、演讲、视频课程、职位信息、测验、演示资料、家庭作业、项目、代码和其它图像、文字、设计、演示、图例、文件、材料、音频和视频剪辑、HTML和文件等，均为思博锐或其关联机构、许可人所有，根据中华人民共和国（“中国”）法律，受到版权、专利权和其他专有知识产权的保护。
</p>
                    <p className="pgraph">思博锐的标识、商标和服务标志（统称为“标志”）会出现在课堂网点上，它们属于思博锐的产权，受中国法律和外国法律的保护。所有在课堂网点、网络课程和招聘信息、活动信息上出现的其它商标、服务标志和标识，无论有无注明归属，均为其各自所有者的商标、服务标志和标识。另外，课堂网点的各元素受中国知识产权法的保护，未经思博锐的明确书面同意，不得以任何方式全部或部分进行复制、转载、下载和散布。
</p>
                    <p className="pgraph">除非本使用条款明确规定，否则用户不得复制、售卖、转售、出示、转载、发布、修改、创造衍生作品、转移、散布或因商业用途利用课堂网点、网络课程或任何学习内容。用户不得对网络课程所需的软件源代码进行还原、反编译和反汇编等行为，或以任何其它方式访问源代码。思博锐会不定期将软件、代码、指令或其它类似信息并入学习内容或网络课程材料；此类信息将“按原样”提供，仅为授课之用，受下述免责条款、责任范围条款及本文其它相关条款的制约。严禁将此类信息用于商业目的。思博锐及其关联机构和许可人保留本文未明确向课堂网点、网络课程、学习内容和标志等授予的所有权力。
</p>
                    <h2 className="agreementH2">课堂网点和网络课程使用许可</h2>
                    <p className="pgraph">在用户遵守本使用条款下，思博锐将向用户授予有限权利和许可。该有限权利和许可随时被撤销，全球通用，非独占，不可转让和不可转授权，您必须遵守所有版权声明和课堂网点或学习内容的限制条件。不得删除课堂网点或学习内容上标注的任何出处、法律声明和所有权声明。
</p>
                    <h2 className="agreementH2">支付条款</h2>
                    <p className="pgraph">如通过课堂网点购买思博锐的任何服务或产品，您必须接入互联网，以及据报名的时候向您告知的有效支付方式（“支付方式”）。您同意思博锐或其第三方付款提供商储存您的支付信息。您同时也同意支付在思博锐课堂网点购买的服务和产品的相关应付费用，采用按次或订阅的方式完成支付。
</p>
                    <p className="pgraph">此外，如您对服务或产品的使用率较低，或有不满之处，我们并不保证退款。</p>
                    <p className="pgraph">现在订阅思博锐产品或服务可享受免费试用期。任何订阅项目的免费试用期天数将在报名之时告知。任何产品或服务的免费试用不得与“优惠页面”中列出的其它优惠项目重叠使用。如您已在前6个月中订阅了某项付款服务或产品，或您的支付方式、实际地址或电子邮箱已与该项服务的账户建立了关联，您将不再具有免费试用该项服务或产品的资格。如您在开始订阅项目的时候申请了免费试用，我们将在试用期结束的时候向您收取月费，除非您在试用期结束之前取消订阅。一旦您申请了免费试用，支付方式将被授权支付最多一个月的费用。在一些情况下，您的可用余额或信用额度会降低以反应该授权，但是除非您未在试用期结束之前取消订阅，不会实际收取费用。您可以通过进入您的账户设置界面随时取消订阅。如在免费试用期间取消订阅，我们不会从您的支付方式收取任何费用。您在免费试用期间可能无法获得产品或服务的某些特殊功能。例如，无法获得认证证书或类似的认证，因为您必须为订阅的课程支付至少1个月的费用才有资格获得该课程的认证证书。如要获得纳米学位，则必须支付不短于2个月的网络课程的费用。
</p>                  
                    <h2 className="agreementH2">服务项目的可用性和局限性</h2>
                    <p className="pgraph">用户认可和同意，思博锐的服务项目，包括付费服务和产品，并非随时可用，并可能存在一些使用限制。关于服务项目的局限和可用时间，请参见网站详情。另外，您也理解，思博锐可自行采取决定，限制、暂停或终止您使用任何思博锐提供的与课程相关的服务项目。同时，您也理解思博锐可自行采取决定，更改或终止所有与课程相关的服务项目。
</p>
                    <h2 className="agreementH2">免责条款</h2>
                    <p className="pgraph">您明确认可并同意，您在访问课堂网点、网络课程以及课堂网点提供的所有内容和服务时，需自行承担所有风险和责任。网络课程（包括任何内容）以“按原样”和“按现状”的形式提供，无任何形式的明示或默示陈述或保证，包括但不限于对适销性、为特定目的的适合性以及非侵权的的默示保证。您在学习网络课程及相关内容时需自行承担所有责任和风险。</p>
                    <p className="pgraph">在不限制前述规定的前提下，我们不做出以下保证：（1）课堂网点、学习内容或网络课程将符合您的要求或期望，达到预期目的；（2）课堂网点或网络课程及时、安全或无误或不会被中止或中断；（3）课堂网点或网络课程提供的信息和学习内容都准确、完整、不过时、无误、完全安全或可靠；或（4）课堂网点或学习内容的各种缺陷将得到纠正。您将自行承担所有人身伤害风险，包括因访问网络课程和学习内容造成的死亡或个人财产的丧失。
</p>
                    <h2 className="agreementH2">与其它站点的链接</h2>
                    <p className="pgraph">课堂网点可能含有前往其他网站页面的链接（称为“链接网站”），这些链接网站含有其他内容，或销售产品和服务。思博锐未对这些链接网站进行创建、编辑、控制或监督。用户认可和同意：（1）我们对链接网站提供的信息的准确性和有效性不负有任何责任；（2）我们对链接网站的赞助商或其内容、产品、广告和其它宣传资料无任何掌控或支持。我们可随时以任何理由（或不以任何理由）从课堂网点上删除这些链接网站。
</p>
                    <p className="pgraph">思博锐对您通过链接网站与第三方机构进行任何交易产生的后果，以及此类网站提供的陈述或信息所产生的债务不负有任何责任。
</p>
                    <p className="pgraph">我们理解链接网站可能含有涉及其运营商知识产权的内容。我们尊重这些权力，提供此类链接仅供用户参考。我们提供链接网站的链接并不表示我们与其运营商之间建立了任何合作关系。
</p>
                    <h2 className="agreementH2">赔偿条款</h2>
                    <p className="pgraph">用户同意赔偿思博锐及所遭受的由与下列情况有关的，或由下列情况产生的,由第三方提出的所有形式的索赔、债务、开支和损失,包括合理的律师费用和花费，该等情况包括：（1）您在访问或尝试访问课堂网点和网络课程的时候违反了本使用条款；（2）您在访问或尝试访问任何代码、课程、数据、信息或课堂网点和网络课程提供的任何学习内容的时候违反了使用条款；（3）您使用或违反了任何第三方的法律或权力；或（4）您在课堂网点和网络课程发布的信息，包括但不限于知识产权或其它专有权利的侵权索赔等。
</p>
                    <h2 className="agreementH2">权力终止</h2>
                    <p className="pgraph">用户同意，思博锐可自行采取决定，以任何理由（或不以任何理由）取消您的账号，或通过其它方式禁止您继续访问课堂网点和网络课程，包括但不限于以下思博锐认为已经发生的情况：（1）您违反了本使用条款；（2）您侵犯了第三方的知识产权；（3）您向课堂网点发布、上传或传播未经授权的内容；或（4）您违反或触犯了本使用条款及任何相关行为准则的条文或其精神。用户同意，思博锐无需事先通知，即可取消您访问课堂网点和网络课程。账号被取消后，思博锐对您或任何第三方不承担任何责任。另外，用户还认可，思博锐在禁止您访问网络课程后，仍可在其系统中保留和储存您的相关信息。
</p>
                    <h2 className="agreementH2">协议修改</h2>
                    <p className="pgraph">根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，我们保留随时自主修改或变更使用条款的权利。修改或变更后的使用条款在课堂网点上进行公布后将立即生效。
</p>
                    <p className="pgraph">我们将采取合理步骤向用户通知使用条款的任何修改或变更，但用户应定期查看用户条款的最近更新情况。思博锐将会直接在思博锐网站上公布修改之后的协议内容，该公布行为视为思博锐已经通知用户修改内容。思博锐也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。
</p>
                    <p className="pgraph">如果不同意思博锐对本协议相关条款所做的修改，用户有权并应当停止使用。如用户继续使用课堂网点或网络课程，即默认为接受我们对使用条款进行的修改或变更。
</p>
                </div>
            </div>
        </Col>
        <Col xs={2} md={1}></Col>
      </Grid>
    );
  }
}