import React from 'react';
import Grid from 'react-bootstrap/lib/Grid';
import Row from 'react-bootstrap/lib/Row';
import Col from 'react-bootstrap/lib/Col';
import * as request from 'superagent';

export default class Agreement extends React.Component {
  constructor() {
    super();
  }

  render() {
    return (
      <Grid>
        <Col xs={2} md={1}></Col>
        <Col xs={14} md={10}>
            <div>
                <div>
                    <h1 className="agreementH1 bigMarginTop">思博锐协议（草案）</h1>
                </div>
                <div>
                    <h2 className="agreementH2"></h2>
                    <p className="pgraph"></p>
                    <p className="pgraph"></p>

                    <p className="pgraph">欢迎您来到思博锐。</p>
                    <p className="pgraph">请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入思博锐或立即停止使用思博锐。当您开始在思博锐进行注册，或者以任何方式实际使用思博锐的网络服务产品、网络课程，无论是进入思博锐，还是在思博锐上发布任何信息（即「信息」），均意味着您（即「用户」）完全接受本协议项下的全部条款以及任何在思博锐网站上公示的使用规则，并且完全接受本协议项下的全部条款任何时候的修订和更新。
</p>
                    <h2 className="agreementH2">用户账号和用户注册
</h2>
                    <p className="pgraph">虽然任何访问思博锐网站的访客都可以查看思博锐网络服务产品，但如需使用这些思博锐网络服务产品和参加网络课程，用户必须使用一个有效的登录身份（即用户ID）和用户密码。一名用户仅可注册一次，不得设置多个用户账号。密码是用户账号下唯一的，且应符合思博锐不时更新的密码规则并且与用户名完全不同（统称为“用户账号”）。用户同意将不以任何理由泄露或与他人共享用户的户账号。如用户未获得相应资格，则不能使用和参加网络课程。
</p>
                    <p className="pgraph">在设置用户账号时，系统可能会提示或要求用户输入补充信息，包括但不限于用户的姓名、电子邮箱和其他思博锐要求用户提供的有效有联系方式。若用户拒绝提供思博锐要求提供的联系方式，则思博锐有权拒绝用户的注册。提供补充信息是为了确认用户的身份。用户理解并同意，用户提供的所有信息均是真实、准确、最新和完整的，并用户将维护和更新用户的信息以保证其真实、准确、未过时和完整。用户认可如用户提供的任何信息存在不准确、虚假、过时或不完整的情况，我们保留在适当程度内无责任终止用户访问思博锐网络服务产品、参加网络课程的权利。
</p>
                    <p className="pgraph">用户注册成功后，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。用户须对在思博锐的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；否则思博锐有权立即无责任地停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任，并且思博锐有权不予返还已经收取的服务费用（若有）。
</p>
                    <p className="pgraph">除注册流程之外，在用户使用思博锐网络服务产品、参加网络课程的过程当中，我们会获取用户的相关信息和用户在网络课程中的使用情况。部分信息可能为个人身份信息。我们可使用、保管以及存储这些信息，以便在当前和未来为用户提供相关服务，同时可与第三方共享此类信息。
</p>
                    <p className="pgraph">隐私政策进一步阐述了我们如何对待用户参加网络课程和在线求职时用户提供的以及我们获得的信息。隐私政策与使用条款合并在一起，以供用户参考。请仔细阅读该政策有关收集、使用和披露用户的个人信息的说明。如用户在思博锐的任何网站上进行注册，即默认接受我们的隐私政策。
</p>
                    <h2 className="agreementH2">学员用户
</h2>
                    <p className="pgraph">如用户为学习思博锐网络课程的学员身份，须同意并遵守以下要求： 
</p>
                    <p className="pgraph">- 学员用户的注册目的是为完成已报名参加的网络课程和在线求职； 
</p>
                    <p className="pgraph">- 学员用户需同意，思博锐及任何网络课程的讲师，均不承担保证该课程以及思博锐及任何网络课程出具的认证证书受到任何权威机构或教育机构认可的义务。
</p>
                    <p className="pgraph">- 学员用户必须遵守思博锐网站列出的“学员行为准则”。
思博锐可与教育合作伙伴联合向学员用户提供网络课程，或代表其教育合作伙伴向学员用户提供课程。用户可以通过提供给用户的单独的用户账号获得使用该课程的权限，用户认可并同意，除了思博锐的使用条款之外，用户在参加任何与教育合作伙伴相关的网络课程时也应遵守教育合作伙伴的条款、政策以及流程的规定。
</p>
                    <p className="pgraph">思博锐和网络课程讲师保留调整、修改、变更和重新制订课题计划和各项作业、测试、测验、考试、项目及其它进度评估项的分值和权重的权利。学员如果参加了网络课程，即已经同意思博锐和该网络课程的讲师保留调整、修改、变更和重新制定该课程的权利，如果学员不同意整、修改、变更和重新制定该课程，则视为双方均同意终止该课程。
</p>
                    <h2 className="agreementH2">支付条款
</h2>
                    <p className="pgraph">如在思博锐网站上购买思博锐的任何服务或产品，用户必须接入互联网，以及据购买的时候网站向用户告知的有效支付方式（“支付方式”）。用户同意思博锐或其第三方付款提供商预先储存用户的支付信息。用户同时也同意支付在思博锐思博锐网络服务产品购买的服务和产品的相关应付费用，采用按次或订阅的方式完成支付。
</p>
                    <p className="pgraph">现在订购思博锐产品或服务可享受免费试用期。任何订购项目的免费试用期天数将在报名之时告知。任何产品或服务的免费试用不得与“优惠页面”中列出的其它优惠项目重叠使用。如用户已在前6个月中订购了某项付款服务或产品，或用户的支付方式、实际地址或电子邮箱已与该项服务的账户建立了关联，用户将不再具有免费试用该项服务或产品的资格。如用户在开始订购项目的时候申请了免费试用，我们将在试用期结束的时候向用户收取月费，除非用户在试用期结束之前取消订阅和试用。一旦用户申请了免费试用，支付方式将被授权支付最多一个月的费用。在一些情况下，用户的可用余额或信用额度会降低以反应该授权，但是除非用户未在试用期结束之前取消订阅，不会实际收取费用。用户可以通过进入其账户设置界面随时取消订阅。如在免费试用期间取消订阅，我们不会从用户的支付方式收取任何费用。用户在免费试用期间可能无法获得产品或服务的某些特殊功能。例如，无法获得认证证书或类似的认证，因为用户必须为订阅的课程支付至少1个月的费用才有资格获得该课程的认证证书。如要获得纳米学位，则必须支付不短于2个月的网络课程的费用。
</p>
                    <p className="pgraph">由于用户享有申请免费试用的权利，因此，不论用户实际行使或放弃了免费试用的权利，当用户订购了思博锐的收费服务后，如用户因对服务或产品的使用率较低，或有不满之处等主观原因退订、终止服务的，思博锐对已经收取的费用都不予退还。
</p>
                    <h2 className="agreementH2">思博锐的知识产权
</h2>
                    <p className="pgraph">思博锐网络服务产品和网络课程所提供的所有内容或资料，包括但不限于在线讲座、演讲、视频课程、职位信息、测验、演示资料、家庭作业、项目、代码和其它图像、文字、设计、演示、图例、文件、材料、音频和视频剪辑、HTML和文件等，均为思博锐及其关联机构、许可人所有，受到中华人民共和国（“中国”）知识产权法律的保护。
思博锐的任何商号、商标和产品、服务标志（统称为“标识”）会出现在思博锐网络服务产品上，它们属于思博锐所有，受中国法律和外国法律的保护。所有在思博锐网络服务产品、网络课程和招聘信息、活动信息上出现的其它商标、服务标志和标识，无论有无注明归属，均为思博锐和其各自所有者的商标、服务标志和标识。另外，思博锐网络服务产品的任何元素受中国知识产权法的保护，未经思博锐的明确书面同意，不得以任何方式全部或部分进行复制、转载、下载和散布。
</p>
                    <p className="pgraph">思博锐及其许可人享有本网站网络服务产品、网络课程或任何学习内容的全部版权，各产品的权利声明有特殊规定的，从其规定。用户不得复制、出版、发行、展示、转载、发布、修改、创造衍生作品或以任何方式使用思博锐网络服务产品、网络课程或任何学习内容。用户不得对网络课程或任何学习内容所需的软件源代码进行还原、反编译和反汇编等行为，或以任何其它方式访问、复制、修改、传播、展示源代码。思博锐会不定期将软件、代码、指令或其它类似信息并入学习内容或网络课程材料；此类信息将“按原样”提供，仅为授课之用，受本协议免责条款、责任范围条款及本协议其它相关条款的制约。严禁将此类信息用于任何商业或非商业目的。思博锐及其关联机构和许可人保留本文未明确向思博锐网络服务产品、网络课程、学习内容和标识等授予的所有权利。
在用户遵守本使用条款下，思博锐将向用户授予有限权利和许可。该有限权利和许可随时被撤销，全球通用，非独占，不可转让和不可转授权，用户必须遵守所有版权声明和思博锐网络服务产品或学习内容的限制条件，不得删除思博锐网络服务产品或学习内容上标注的任何出处、法律声明和权利声明。
</p>
                    <h2 className="agreementH2">服务项目的使用限制
</h2>
                    <p className="pgraph">思博锐网络服务产品、网络课程由思博锐及该课程的许可人所有和负责运营。思博锐保留随时不定期暂时性或永久性修改、暂停、终止思博锐网络服务产品、网络课程及其任何部分的权利，并自行决定是否通知用户。用户同意，思博锐针对思博锐网络服务产品、网络课程及其任何部分进行的修改、暂停或终止，无需对用户或第三方机构承担责任。在本使用条款中，无任何规定要求思博锐必须在其执行期间维护和支持思博锐网络服务产品、网络课程及其任何部分。
</p>
                    <p className="pgraph">用户认可和同意，思博锐的服务项目存在特性，包括付费服务和产品，并非随时可用，并可能存在一些使用限制。关于服务项目的局限和可用时间，请参见思博锐网站详情。另外，用户也理解，思博锐可自行采取决定，限制、暂停或终止用户使用任何思博锐提供的服务项目。同时，用户也理解思博锐可自行采取决定，更改或终止思博锐提供的服务项目。
</p>
                    <h2 className="agreementH2">用户权利的终止
</h2>
                    <p className="pgraph">用户同意，思博锐认为已经发生的，包括但不限于以下情况下，可自行采取决定取消用户的账号，或通过其它方式禁止用户继续访问思博锐网络服务产品和网络课程：（1）用户违反了本使用条款；（2）用户侵犯了第三方的知识产权；（3）用户向思博锐网络服务产品发布、上传或传播未经授权的内容；或（4）用户违反或触犯了本协议条款及任何相关行为准则的条文或其精神。
</p>
                    <p className="pgraph">用户同意，思博锐无需事先通知，即可取消用户访问思博锐网络服务产品和网络课程。账号被取消后，思博锐对用户或任何第三方不承担任何责任。另外，用户还认可，思博锐在禁止用户访问网络课程后，仍可在其系统中保留和储存用户的相关信息。
</p>
                    <h2 className="agreementH2">赔偿条款
</h2>
                    <p className="pgraph">用户同意赔偿思博锐及所遭受的由与下列情况有关的，或由下列情况产生的,由第三方提出的所有形式的索赔、债务、开支和损失,包括合理的维权费用、公证费、律师费用和其他开支费用，该等情况包括：（1）用户在访问或尝试访问思博锐网络服务产品和网络课程的时候违反了本协议条款；（2）用户在访问或尝试访问任何代码、课程、数据、信息或思博锐网络服务产品和网络课程提供的任何学习内容的时候违反了本协议条款；（3）用户使用或违反了任何法律、法规；或（4）用户在思博锐网络服务产品和网络课程发布的信息侵犯了第三方的合法权利，包括但不限于知识产权或其它专有权利的侵权索赔等。
</p>
                    <h2 className="agreementH2">思博锐责任限制条款
</h2>
                    <p className="pgraph">用户明确认可并同意，在访问思博锐网络服务产品、网络课程以及思博锐网络服务产品提供的所有内容和服务时，需自行承担所有风险和责任。网络课程（包括任何内容）以“按原样”和“按现状”的形式提供，无任何形式的明示或默示陈述或保证，包括但不限于对网站二十四小时的连续稳定性、服务或产品的适销性、为特定目的的适合性以及非侵权的的默示保证。用户在学习网络课程及相关内容时需自行承担所有责任和风险。
</p>
                    <p className="pgraph">在不限制前述规定的前提下，我们不做出以下保证：（1）思博锐网络服务产品、学习内容或网络课程将符合用户的要求或期望，达到预期目的；（2）思博锐网络服务产品或网络课程及时、安全或无误或不会被中止或中断；（3）思博锐网络服务产品或网络课程提供的信息和学习内容都准确、完整、不过时、无误、完全安全或可靠；或（4）思博锐网络服务产品或学习内容的各种缺陷将得到纠正。用户将自行承担所有人身伤害风险，包括因访问网络课程和学习内容造成的人身或个人财产的损失。
</p>
                    <p className="pgraph">思博锐就任何网络服务产品、网络课程对用户承担的赔偿责任总额不超过用户对于订购该网络服务产品、网络课程已经完成支付的费用数额。
</p>
                    <h2 className="agreementH2">与其它站点的链接
</h2>
                    <p className="pgraph">思博锐网络服务产品可能含有前往其他网站页面的链接（称为“链接网站”），这些链接网站含有其他内容，或销售产品和服务。思博锐未对这些链接网站进行创建、编辑、控制或监督。用户认可和同意：（1）我们对链接网站提供的信息的真实性、准确性和有效性不负有任何责任；（2）我们对链接网站的赞助商或其内容、产品、广告和其它宣传资料无任何关联关系，也没有任何掌控或支持。我们可随时以任何理由（或不以任何理由）从思博锐网络服务产品上删除这些链接网站。
</p>
                    <p className="pgraph">思博锐对用户通过链接网站与第三方机构进行任何交易产生的后果，以及此类网站提供的陈述或信息所产生的债权债务关系不负有任何责任。
</p>
                    <p className="pgraph">我们理解链接网站可能含有涉及其运营商知识产权的内容。我们尊重这些权利，提供此类链接仅供用户参考。我们提供链接网站的链接并不表示我们与其运营商之间建立了任何合作关系。
</p>
                    <h2 className="agreementH2">本协议及产品使用规则的修改和更新
</h2>
                    <p className="pgraph">根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，思博锐保留随时自主修改或变更本协议条款以及任何在本网站上公示的使用规则（条款及规则）的权利。修改或变更后的条款及规则在思博锐网站上进行公布后立即生效。

思博锐将采取合理步骤向用户通知条款及规则的任何修改或变更，但用户应定期查看用户条款的最近更新情况。该合理的通知步骤是：思博锐将会直接在思博锐网站上公布修改之后的条款及规则，该公布行为视为思博锐已经通知用户。思博锐也可选择采用通过用户在思博锐网站上的注册账户（用户ID）预留的电子邮件或私信的传送方式，提示条款及规则的修改、服务变更、或其它重要事项，在此情况下思博锐发出通知之时即视为通知生效。
</p>
                    <p className="pgraph">如果不同意思博锐对相关条款及规则所做的修改，用户有权并应当停止使用。如用户继续使用思博锐网络服务产品或网络课程，即默认为接受思博锐对条款及规则进行的修改或变更。
</p>
                </div>
            </div>
        </Col>
        <Col xs={2} md={1}></Col>
      </Grid>
    );
  }
}