{
	"CompanyList": [
	{
		"companyTitle" : "网球大师【上海】",
		"companyImage" : "",
		"companyInfo" : "《网球大师》致力于打造专业领域第一杂志品牌，杂志创办以来深受网球大师用户喜欢，杂志发行量为网球大师行业领头羊。",
		"companyLocation" : "公司地点：上海市",
		"positionList" : [
			{
				"positionTitle" : "",
				"positionRespons" : ["", ""],
				"positionRequire" : ["", ""],
				"positionCompo" : ["", ""],
				"positionApplication" : ["", ""] 
			},
			{
				"positionTitle" : "",
				"positionRespons" : ["", ""],
				"positionRequire" : ["", ""],
				"positionCompo" : ["", ""],
				"positionApplication" : ["", ""] 
			}
		]
	},{
		"companyTitle" : "渤锐体育【北京】",
		"companyImage" : "",
		"companyInfo" : "北京渤锐体育科技发展有限公司（BridgeCC）总部位于加拿大温哥华，2016年来到北京，是中国第一家体育运动精英孵化器。渤锐体育致力于通过大数据和体育经纪挖掘中国芸芸众生中的运动天才，帮助他们实现价值最大化。",
		"companyLocation" : "公司地点：北京市"
	},{
		"companyTitle" : "优胜美地瑜伽【北京】",
		"companyImage" : "",
		"companyInfo" : "优胜美地瑜伽是北京燕莎商圈炙手可热的精致商业品牌“官舍生活会”旗下的瑜伽品牌，始于2005年，于杭州西子湖畔吴山深处一栋百年古建中开设了第一家瑜伽馆。2012年在北京万科公园五号开设了旗舰馆，并陆续在深圳、青岛、北京亮马桥开设分馆。

优胜美地瑜伽秉持“与人为真、于事为优、于心为美”的宗旨，是将自然环境和人文环境深度结合的瑜伽馆，也是健康、自然、和谐、圆融生活的倡导者与推行者。是明星及城市菁英衷爱的瑜伽习练场所，精致的习练空间也成为很多时尚杂志喜爱的拍摄地。",
		"companyLocation" : "公司地点：北京市朝阳区东方东路19号亮马桥官舍南区三层1B室"
	},{
		"companyTitle" : "篮战体育【北京&佛山】",
		"companyImage" : "",
		"companyInfo" : "篮战(北京)体育文化传播有限公司，是一群来自于互联网、体育、数据、地产等领域对于中国篮球怀抱着满腔热血与热情的年轻人所组建的针对篮球主题的全能平台。以改变民间篮球生态的梦想和实现篮球行业标杆的企业为目标。

篮战以鲜明的篮球基因，以国内独有的篮球数据分析与视频强大的智能化数据系统，集成运动、社交……等多项创新复合功能，为全民体育爱好者提供全方位的平台服务。

篮战平台是全民体育文化产业的转型和创新尝试。目前已经成立北京总部，并发展了广东公司。篮战通过篮球赛事内容服务，球场智能化开发，篮球与空间资产的结合三个方向进行创新模式的开发。

目前篮战平台与美国顶级联赛REAL RUN、Eurobasket Summer League、drew league等达成签约合作、以及法国顶级街球赛事QUAI54达成排他性签约，正式通过篮战向世界赛事输送球员，同时与中关村领创空间、上体产业、平安银行等企业，已达成长期战略合作协议。

2016年实现篮球＋娱乐真人秀的节目开发，篮战城际赛系列赛事的全国范围进一步扩张。2017年实现篮战球场全国开发60家。

篮战微信公众号：篮战hoopbattle
篮战网站：http://www.hoopbattle.com/",
		"companyLocation" : "公司地点：北京、佛山"
	},{
		"companyTitle" : "爱奇艺体育",
		"companyImage" : "",
		"companyInfo" : "爱奇艺体育自2012年8月上线以来，始终坚持布局高端品质赛事的核心战略，并在与网球、高尔夫、NFL、搏击、极限运动等重磅体育赛事达成战略合作的过程中，积累了丰富的高端体育赛事资源与运营经验，愈发得到行业与高素质用户的认可。

拥有十年WTA、澳网、高尔夫美巡赛、女排欧冠联赛等独家版权的爱奇艺体育要招人了，想要在体育领域大展身手的你还不快把简历投来。",
		"companyLocation" : "工作地点：北京"
	},{
		"companyTitle" : "WME | IMG中国【上海】",
		"companyImage" : "",
		"companyInfo" : "WME | IMG在中国已经历了数十年的发展，成绩斐然。其业务包括代理顶级运动员李娜；承办世锦赛-汇丰冠军赛及深圳公开赛等职业高尔夫和网球赛事；代表中超联赛等体育联赛组织洽谈版权权益；与CCTV建立合资企业以推动体育赛事的推广营销；为旅游业、体育运动、合作伙伴及赛事机构等提供策略建议；举办彩色跑等大众参与项目；协办开展深圳时装周等时尚活动。",
		"companyLocation" : "工作地点：上海"
	},{
		"companyTitle" : "乌潮网",
		"companyImage" : "",
		"companyInfo" : "乌潮网是一个体育领域的媒体矩阵，旗下拥有快篮球，最速足球，洋葱圈体育及体育研习社四个自媒体，内容覆盖行业资讯、热点时评、赛事、商业方面等。

其中，快篮球和最速足球立足于提供体育资讯和视频节目，旨在做不庸俗的体育资讯传播者。目前单月阅读量过亿，影响数以百万的球迷。乌潮网会吸纳更多的垂直媒体加入，形成涵盖运动、娱乐、文化、生活方式的媒体矩阵。",
		"companyLocation" : "工作地点：广州市天河区"
	},{
		"companyTitle" : "沃尔沃环球帆船赛东风队【全球】",
		"companyImage" : "",
		"companyInfo" : "东风队是一支中国职业远洋帆船队，在2014-15赛季沃尔沃环球帆船赛中获得季军，是沃尔沃环球帆船赛史上第一支登上终极领奖台的中国船队。东风队将由东风汽车公司提供100%支持，再次由英国OC体育管理有限公司负责管理运营，继续参加2017-18赛季沃尔沃环球帆船赛。 ",
		"companyLocation" : "工作地点：全球"
	},{
		"companyTitle" : "沙砾运动生活",
		"companyImage" : "",
		"companyInfo" : "
一个融合了商业地产、体育场馆、智能建筑、投资机构的行业精英的地方，以北京和上海作为双总部。一家以全民健身体育场馆的投资开发、设计建设、运营管理为核心业务的创新型体育公司以为国民打造快乐运动场所为理念  作为国际顶尖大型活动临时用房的制造公司—劳斯伯格的兄弟企业，目前已在全国落地场馆14座，分别位于北京、上海、武汉、山西、重庆等7座一线城市，涉及不同运动项目达10个，还有更多进行中的场项目正在进行中…… ",
		"companyLocation" : "工作地点：北京市，上海市"
	},{
		"companyTitle" : "重庆市黔江区体育运动中心【重庆】",
		"companyImage" : "",
		"companyInfo" : "重庆市黔江区体育运动中心隶属于重庆市黔江区文化委（体育局）下属事业单位，其主要工作职责为：

1、负责辖区内体育馆、体育场、游泳馆、民族健身中心（羽毛球、风雨篮球场、门球场）日常经营管理；进一步探索体育场馆运行机制改革，积极培育和努力开拓体育市场，合理规范体育场馆经营活动，增强体育场馆的自我发展能力。

2、合理调配资源、改善服务效能，创新惠民举措、拓展服务项目、延伸配套服务，不断提高公共服务水平和场馆使用率，向社会提供多样化和人性化的公共体育服务，力争形成1－2个在重庆有影响的群众体育健身项目；不折不扣做好辖区内免费低收费开放工作。

3、加强青少年体育竞技体育的引导和管理，利用场馆优势，走市场化路子，形成以“场馆+学校+社会骨干力量”三方为主的合作模式，重点打造以篮球、足球、游泳、羽毛球、乒乓球、田径等为龙头的青少年竞技体育项目，力争用3-4年时间有2－3个项目进入市级重点项目。

根据以上职责所需，特面向广大应届毕业生招聘下列专业体育人士共谋发展之大计。",
		"companyLocation" : "公司地点：重庆市"
	}
]
}